Repository: mariodebian/tcos-configurator
Catalog: po/*.po
Languages: es, gl, pt_br

source: TCOS Server configurator
es: Configurador del servidor TCOS
gl: Configurador do servidor TCOS

source: <span size="x-large">Configure TCOS server</span>
es: <span size="x-large">Configurar servidor TCOS</span>
gl: <span size="x-large">Configurar servidor TCOS</span>
pt_br: <span size="x-large">Configurando o servidor TCOS</span>

source: DHCP net interface
es: Interfaz de red DHCP
gl: Interface de rede DHCP
pt_br: Interface de rede DHCP

source: Start IP
es: IP de inicio
gl: IP de inicio
pt_br: IP inicial

source: End IP
es: IP final
gl: IP final
pt_br: IP final

source: Commit changes
es: Guardar cambios
gl: Gardar cambios
pt_br: Aplicar as modificações

source: Boot mode
es: Modo de arranque
gl: Modo de arranque
pt_br: Método de Boot

source: Server IP
es: Dirección IP
gl: Enderezo IP
pt_br: IP do servidor

source: WARNING: <b>Detected dynamic IP</b>
es: ADVERTENCIA: <b>Se ha detectado IP dinámica</b>
gl: ADVERTENCIA: <b>Detectouse IP dinámica</b>
pt_br: AVISO: <b>IP dinâmico detectado</b>

source: configure this IP as static (disable NetworkManager)
es: configurar esta IP como estática (desahilita NetworkManager)
gl: configurar esta IP como estática (desahilita NetworkManager)
pt_br: Configure este IP como estático (desabilitando o NetworkManager)

source: host
es: equipo
gl: equipo
pt_br: terminal

source: Hostname prefix
es: Prefijo de equipo
gl: Prefixo de equipo
pt_br: Prefixo do terminal

source: DHCP server
es: Servidor DHCP
gl: Servidor DHCP
pt_br: Servidor DHCP

source: Numer of users to create
es: Número de usuarios a crear
gl: Número de usuarios a crear
pt_br: Quantidade de usuário a serem criados

source: Prefix
es: Prefijo
gl: Prefixo
pt_br: Prefixo

source: Groups to add users (use spaces to separate) (default fuse)
es: Grupos que pertenece el usuario (usar espacios para separar) (por defecto fuse)
gl: Grupos que pertence o usuario (usar espacios para separar) (por defecto fuse)
pt_br: Adicione estes usuário ao(s) grupo(s) (use o espaço em branco para separar os nomes dos grupos. O padrão é o fuse).

source: user
es: usuario
gl: usuario
pt_br: usuário

source: <b>Passwords are same string as username</b>
es: <b>Las contraseñas es el nombre de usuario</b>
gl: <b>Os contrasinais son o nome do usuario</b>
pt_br: <b>As senhas são palavras, assim como os nomes dos usuários</b>

source: Remote users
es: Usuarios remotos
gl: Usuarios remotos
pt_br: Usuários Remotos

source: enable autologin
es: activar autologin
gl: activar inicio de sesión automático
pt_br: Habilitar o login automático

source: Autologin timeout (in seconds)
es: Tiempo de espera para entrada automática (en segundos)
gl: Tempo de espera para inicio de sesión automática (en segundos)
pt_br: Inicie o autologin após (tempo em segundos)

source: Remote login (required for TCOS)
es: Entrada remota (TCOS lo necesita)
gl: Entrada remota (TCOS necesitao)
pt_br: Login remoto (requerido pelo TCOS)

source: enable remote login
es: activar entrada remota
gl: activar entrada remota
pt_br: Habilitar o login remoto

source: Autologin
es: Entrada automática
gl: Inicio de sesión automática
pt_br: Login automático

source: Login manager
es: Gestor de entrada
gl: Xestor de entrada
pt_br: Gerenciador de Login

source: Launch TcosConfig
es: Ejecutar TcosConfig
gl: Executar TcosConfig
pt_br: Iniciar o TcosConfig

source: TcosConfig is a tool to generate TCOS network boot images. The images are downloaded using PXE protocol. You can add or remove some tools in images and configure a lot of hardware settings.
es: TcosConfig es una herramienta para generar imágenes de arranque TCOS. Las imágenes se descarganán por la red mediante el protocolo PXE. Puedes añadir o quitar algunas herramientas, así como configurar variables de hardware.
gl: TcosConfig é unha ferramenta para xerar imaxes de arranque TCOS. As imaxes descargaranse pola rede mediante o protocolo PXE. Podes engadir ou quitar algunhas ferramentas, asi como configurar variables de hardware.
pt_br: O TcosConfig é uma ferramenta para gerar as imagens de boot via rede. As imagens são obtidas usando o protocolo PXE. Você pode adicionar ou remover algumas ferramentas nas imagens, além de configurá-las para vários tipos de hardware.

source: Boot images
es: Imágenes de arranque
gl: Imaxes de arranque
pt_br: Imagens de Boot

source: Autologin help
es: Ayuda para el autologin
gl: Axuda para o inicio de sesión automático
pt_br: Ajuda para o Autologin

source: <b>TCOS Autologin</b>
es: <b>Entrada automática TCOS</b>
gl: <b>Inicio de sesión automática TCOS</b>

source: TCOS can work in kiosk mode. All you need is to configure the hostnames with the <b><u>same</u></b> value as usernames. Example:
es: TCOS puede funcionar en modo kiosko. Todo lo que necesitas es configurar los nombres de equipo con el <b><u>mismo</u></b> prefijo de nombre de equipo y nombre de usuario Ejemplo:
gl: TCOS pode funcionar en modo quiosco. Todo o que necesitas é configurar os nomes de equipo co <b><u>mesmo</u></b> prefixo de nome de equipo e nome de usuario Exemplo:
pt_br: O TCOS pode trabalhar no modo kiosk. Você precisa configurar os nomes dos terminais com <b><u>os mesmos</u></b> nomes dos usuários. Exemplo:

source: <b>Users:</b> from user01 to user15 <b>Hostnames:</b> from user01 to user15
es: <b>Usuarios:</b> desde usuario01 a usuario15 <b>Nombre de equipo:</b> desde usuario01 a usuario15
gl: <b>Usuarios:</b> dende usuario01 a usuario15 <b>Nome de equipo:</b> dende usuario01 a usuario15
pt_br: <b>Usuários:</b> de usuario01 a usuario15 <b>Terminais:</b> de usuario01 a usuario15

source: <b>1.-</b> Create users with tcos-configurator <b>2.-</b> Configure DHCP with a 15 IP's range (or more) <b>3.-</b> Edit <b>/etc/hosts</b> and add this:
es: <b>1.-</b> Crea los usuarios con tcos-configurator <b>2.-</b> Configura el servidor DHCP con al menos un rango de 15 direcciones IP <b>3.-</b> Edita <b>/etc/hosts</b> y añade esto:
gl: <b>1.-</b> Crea os usuarios con tcos-configurator <b>2.-</b> Configura o servidor DHCP con ao menos un rango de 15 enderezos IP <b>3.-</b> Edita <b>/etc/hosts</b> e engade esto:
pt_br: <b>1.-</b> Crie os usuários com o tcos-configurator <b>2.-</b> Configure no DHCP, uma faixa com 15 IP's (ou mais) <b>3.-</b> Edite o arquivo <b>/etc/hosts</b> e adicione:

source: 192.168.0.101 user01 192.168.0.102 user02 192.168.0.103 user03 ... 192.168.0.115 user15
es: 192.168.0.101 usuario01 192.168.0.102 usuario02 192.168.0.103 usuario03 ... 192.168.0.115 usuario15
gl: 192.168.0.101 usuario01 192.168.0.102 usuario02 192.168.0.103 usuario03 ... 192.168.0.115 usuario15
pt_br: 192.168.0.101 usuário01 192.168.0.102 usuário02 192.168.0.103 usuário03 ... 192.168.0.115 usuário15

source: TCOS and Backharddi
es: TCOS y Backharddi
gl: TCOS e Backharddi
pt_br: TCOS e Backharddi

source: WARNING: <b>Network interface don't have IP</b>
es: ADVERTENCIA: <b>El interfaz de red no tiene IP</b>
gl: AVISO: <b>A interface de rede no ten IP</b>
pt_br: AVISO: <b>Essa interface de rede não possui IP</b>

source: Your %s file will be overwritten. Continue?
es: El archivo %s será sobreescrito. ¿Continuar?

source: <b>Reboot required (or restart gdm/kdm daemon) to enable new GDM/KDM settings</b>
es: <b>Se necesita reiniciar el equipo (o el proceso gdm/kdm) para activar la nueva configuración de GDM/KDM</b>

source: Creating from %(prefix)s%(init)02d to %(prefix)s%(end)02d
es: Creando desde %(prefix)s%(init)02d hasta %(prefix)s%(end)02d
gl: Creando dende %(prefix)s%(init)02d ata %(prefix)s%(end)02d
pt_br: Criando de %(prefix)s%(init)02d a %(prefix)s%(end)02d

source: Creating user: '%s'
es: Creando usuario: '%s'
gl: Creando usuario: '%s'
pt_br: Criando os usuários: '%s'

source: User already exists: '%s'
es: El usuario ya existe: '%s'
gl: O usuario xa existe: '%s'
pt_br: Os seguintes usuários já existem: '%s'

source: <b>Done</b>
es: <b>Hecho</b>
gl: <b>Feito</b>
pt_br: <b>Feito</b>

source: Configuring DNSMASQ service...
es: Configurando servicio DNSMASQ...

source: <b>Error writing /etc/dnsmasq.conf.</b> Are you root?
es: <b>Error escribiendo /etc/dnsmasq.conf.</b> ¿Suficientes permisos?

source: Configured static network
es: Configurado modo de red estático
gl: Configurado modo de rede estático
pt_br: A rede estática foi configurada

source: ERROR:<b>Error configuring static network.</b>
es: ERROR:<b>Error configurando la red estática.</b>
gl: ERRO:<b>Erro configurando a rede estática.</b>
pt_br: ERRO:<b>Erro ao configurar a rede estática.</b>

source: Restarting DNSMASQ service...
es: Reiniciando servicio DNSMASQ...

source: <b>Error restarting DNSMASQ server.</b>
es: <b>Error reiniciando servidor DNSMASQ</b>

source: Configuring DHCP service...
es: Configurando servicio DHCP...
gl: Configurando servizo DHCP...
pt_br: Configurando o serviço DHCP...

source: <b>Error writing /etc/dhcp3/dhcpd.conf.</b> Are you root?
es: <b>Error escribiendo /etc/dhcp3/dhcpd.conf.</b> ¿Suficientes permisos?
gl: <b>Erro escribindo /etc/dhcp3/dhcpd.conf.</b> ¿Suficientes permisos?
pt_br: <b>Erro ao alterar o arquivo /etc/dhcp3/dhcpd.conf.</b> Você é root?

source: Restarting DHCP service...
es: Reiniciando servicio DHCP...
gl: Reiniciando servizo DHCP...
pt_br: Reiniciando o serviço DHCP...

source: <b>Error restarting DHCP server.</b>
es: <b>Error reiniciando servidor DHCP</b>
gl: <b>Erro reiniciando servidor DHCP</b>
pt_br: <b>Erro ao reiniciar o serviço DHCP.</b>
